#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "/Users/jkitchin/vc/blogofile-jkitchin.github.com/_blog/dynamic-module/")
(require 'pretty)
(g4 [1.0 2.0] 5.0)
#+END_SRC

#+RESULTS:
: [5.0 10.0]

